lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaTemperatureSensorJoinable/ZigbeeHaTemperatureSensorJoinable.ino
bool loadInstallCodeLinkKey(uint8_t outKey[16]) {
#if NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE
  return ZigbeeSecurity::deriveInstallCodeLinkKey(kInstallCode,
                                                  sizeof(kInstallCode), outKey);
#else
  (void)outKey;
  return false;
#endif
}

uint64_t expectedTrustCenterIeee() {
  refreshCommissioningState();
  return ZigbeeCommissioning::expectedTrustCenterIeee(g_network);
}

void applyDefaultReporting() {
  g_device.configureReporting(kZigbeeClusterTemperatureMeasurement, 0x0000U,
                              ZigbeeZclDataType::kInt16, 5U, 60U, 25U);
  g_device.configureReporting(kZigbeeClusterPowerConfiguration, 0x0020U,
                              ZigbeeZclDataType::kUint8, 30U, 300U, 1U);
  g_device.configureReporting(kZigbeeClusterPowerConfiguration, 0x0021U,
                              ZigbeeZclDataType::kUint8, 30U, 300U, 2U);
}

void applyReportingState() {
  if (!g_haveRestoredState || g_restoredState.reportingCount == 0U) {
    applyDefaultReporting();
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.reportingCount && i < 8U; ++i) {
    if (!g_restoredState.reporting[i].used) {
      continue;
    }
    g_device.configureReporting(g_restoredState.reporting[i].clusterId,
                                g_restoredState.reporting[i].attributeId,
                                g_restoredState.reporting[i].dataType,
                                g_restoredState.reporting[i].minimumIntervalSeconds,
                                g_restoredState.reporting[i].maximumIntervalSeconds,
                                g_restoredState.reporting[i].reportableChange);
  }
}

void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void sampleSensors() {
  int32_t tempMilliC = 0;
  if (g_temp.sampleMilliDegreesC(&tempMilliC, 400000UL)) {
    g_device.setTemperatureState(static_cast<int16_t>(tempMilliC / 10L), -4000,
                                 12500, 50U);
  }

  int32_t vbatMv = 0;
  uint8_t vbatPercent = 0;
  if (BoardControl::sampleBatteryMilliVolts(&vbatMv) &&
      BoardControl::sampleBatteryPercent(&vbatPercent)) {
    const uint8_t decivolts =
        static_cast<uint8_t>(vbatMv <= 0 ? 0 : (vbatMv / 100));
    const uint8_t halfPercent =
        static_cast<uint8_t>(vbatPercent >= 100U ? 200U : vbatPercent * 2U);
    g_device.setBatteryStatus(decivolts, halfPercent);
  }
}

void applyJoinLed() {
  Gpio::write(kPinUserLed, g_joined ? false : true);
}

void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = "CleanCore";
  basic.modelIdentifier = "X54-JOIN-TEMP";
  basic.swBuildId = "0.2.0";
  basic.powerSource = 0x03U;
  g_device.configureTemperatureSensor(kLocalEndpoint, kIeeeAddress, g_localShort,
                                      g_panId, basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  sampleSensors();
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, ZigbeeLogicalType::kEndDevice,
      g_device.config().manufacturerCode, &state);

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  return g_store.save(state);
}

void restoreState() {
  memset(&g_restoredState, 0, sizeof(g_restoredState));
  g_haveRestoredState = false;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kTempShort,
                                                kCoordinatorShort);

  ZigbeePersistentState state{};
  if (g_store.load(&state) && state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    ZigbeeCommissioning::restoreEndDeviceState(&g_network, state, kIeeeAddress);
  }

  configureDeviceForCurrentNetwork();
  applyJoinLed();
}

void clearJoinState(bool clearStore) {
  refreshCommissioningState();
  ZigbeeCommissioning::clearEndDeviceState(&g_network, clearStore);
  if (clearStore) {
    memset(&g_restoredState, 0, sizeof(g_restoredState));
    g_haveRestoredState = false;
  }
  configureDeviceForCurrentNetwork();
  applyJoinLed();
  if (clearStore) {
    g_store.clear();
  } else {
    persistState();
  }
}

void requestSecureRejoin() {
  refreshCommissioningState();
  ZigbeeCommissioning::requestSecureRejoin(&g_network);
}

void clearPendingApsAck() {
  memset(&g_pendingApsAck, 0, sizeof(g_pendingApsAck));
}

void rememberPendingApsAck(const ZigbeeApsDataFrame& aps) {
  if (aps.deliveryMode != kZigbeeApsDeliveryUnicast || !aps.ackRequested) {
    clearPendingApsAck();
    return;
  }
  g_pendingApsAck.active = true;
  g_pendingApsAck.counter = aps.counter;
  g_pendingApsAck.clusterId = aps.clusterId;
  g_pendingApsAck.profileId = aps.profileId;
  g_pendingApsAck.destinationEndpoint = aps.destinationEndpoint;
  g_pendingApsAck.sourceEndpoint = aps.sourceEndpoint;
  g_pendingApsAck.deadlineMs = millis() + kApsAckTimeoutMs;
}

bool matchesPendingApsAck(const ZigbeeApsAcknowledgementFrame& ack) {
  return g_pendingApsAck.active && ack.valid && !ack.ackFormatCommand &&
         ack.counter == g_pendingApsAck.counter &&
         ack.clusterId == g_pendingApsAck.clusterId &&
         ack.profileId == g_pendingApsAck.profileId &&
         ack.destinationEndpoint == g_pendingApsAck.sourceEndpoint &&
         ack.sourceEndpoint == g_pendingApsAck.destinationEndpoint;
}

void maybeExpirePendingApsAck(uint32_t nowMs) {
  if (!g_pendingApsAck.active ||
      static_cast<int32_t>(nowMs - g_pendingApsAck.deadlineMs) < 0) {
    return;
  }
  Serial.print("aps_ack miss ctr=0x");
  Serial.print(g_pendingApsAck.counter, HEX);
  Serial.print(" cluster=0x");
  Serial.print(g_pendingApsAck.clusterId, HEX);
  Serial.print("\r\n");
  clearPendingApsAck();
}

bool sendApsAcknowledgement(uint16_t destinationShort,
                            const ZigbeeApsDataFrame& request) {
  if (!g_joined || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

